---
type: ComboBoxCurrentChangedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# ComboBoxCurrentChangedEventArgs

`Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | NewValue | — | `public ComboBoxMember NewValue { get ; }` |
| Property | OldValue | — | `public ComboBoxMember OldValue { get ; }` |